https://Daniellem97.app.spacelift.io/stack/comment-checks/run/01JXNC7N96C6CCW1D1THN48SPW has finished

## Planning logs

```
[01JXM6GE68PT5HT39XKE9CGE22] Planning changes with 0 custom hooks...

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # spacelift_stack.test2223 will be created
  + resource "spacelift_stack" "test2223" {
      + administrative                   = true
      + autodeploy                       = true
      + autoretry                        = false
      + aws_assume_role_policy_statement = (known after apply)
      + branch                           = "master"
      + description                      = "Provisions a Kubernetes cluster"
      + enable_local_preview             = false
      + enable_well_known_secret_masking = false
      + github_action_deploy             = true
      + id                               = (known after apply)
      + manage_state                     = true
      + name                             = "test2"
      + project_root                     = "cluster"
      + protect_from_deletion            = false
      + repository                       = "tftest"
      + slug                             = (known after apply)
      + space_id                         = (known after apply)
      + terraform_external_state_access  = false
      + terraform_smart_sanitization     = false
      + terraform_version                = "1.3.0"
      + terraform_workflow_tool          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

[01JXM6GE68PT5HT39XKE9CGE22] Changes are GO
[01JXM6GE68PT5HT39XKE9CGE22] Uploading the list of managed resources...
[01JXM6GE68PT5HT39XKE9CGE22] Please be aware that the run changes calculation includes output changes.
[01JXM6GE68PT5HT39XKE9CGE22] Resource list upload is GO
[01JXM6GE68PT5HT39XKE9CGE22] Generating JSON representation of the plan...
[01JXM6GE68PT5HT39XKE9CGE22] JSON representation is GO
[01JXM6GE68PT5HT39XKE9CGE22] Loading custom plan policy inputs...
[01JXM6GE68PT5HT39XKE9CGE22] 0 custom plan policy inputs found
[01JXM6GE68PT5HT39XKE9CGE22] No plan policies to evaluate
```
